export const CONFIRM_DIALOG_CONSTANTS = [
  {
    type: 'delete',
    title: 'Хэрэглэгч устгах',
    message: 'Та хэрэглэгч устгахдаа итгэлтэй байна уу?',
    alternativeMessage: 'Устгасан хэрэглэгчийг дахин сэргээх боломжгүй. ' +
      'Системд байгаа хэрэглэгчийн бүх дата устана.',
  },
  {
    type: 'bulk_delete',
    title: 'Олон хэрэглэгч устгах',
    message: 'Та олон хэрэглэгч устгахдаа итгэлтэй байна уу?',
    alternativeMessage: 'Устгасан хэрэглэгчид дахин сэргээх боломжгүй. ' +
      'Системд байгаа хэрэглэгчдийн бүх дата устана.',
  },
  {
    type: 'archive',
    title: 'Хэрэглэгч архивлах',
    message: 'Та хэрэглэгч архивлахдаа итгэлтэй байна уу?',
    alternativeMessage: 'Архивд орсон хэрэглэгч системд нэвтрэх боломжгүй болно.',
  },
  {
    type: 'bulk_archive',
    title: 'Олон хэрэглэгч архивлах',
    message: 'Та олон хэрэглэгч архивлахдаа итгэлтэй байна уу?',
    alternativeMessage: 'Архивд орсон хэрэглэгчид системд нэвтрэх боломжгүй болно.',
  },
  {
    type: 'unarchive',
    title: 'Хэрэглэгч архиваас гаргах',
    message: 'Та хэрэглэгч архиваас гаргахдаа итгэлтэй байна уу?',
    alternativeMessage: 'Архиваас гаргасан хэрэглэгч системд нэвтрэх боломжтой болно.',
  },
  {
    type: 'bulk_unarchive',
    title: 'Олон хэрэглэгч архиваас гаргах',
    message: 'Та олон хэрэглэгч архиваас гаргахдаа итгэлтэй байна уу?',
    alternativeMessage: 'Архиваас гаргасан хэрэглэгчид системд нэвтрэх боломжтой болно.',
  },
];
